tutorials/combustion/coldEngineFoam/freePiston/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM:.khe Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "include/caseSettings"

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform $/internalField/k;

boundaryField
{
    back
    {
        type            wedge;
    }

    front
    {
        $back;
    }

    liner
    {
        $/wall/k;
    }

    cylinderHead
    {
        $liner;
    }

    piston
    {
        $liner;
    }
}

#remove (wall piston)

// ************************************************************************* //
